Pawsibly_api/app/controllers/breeds_controller.rb

  def create
    @breed = Breed.new(breed_params)
    @user = User.find(params[:user_id])
    @breed.user_id = @user.id
# puts @breed
logger.info(@breed)

    if @breed.save!
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "breeds" ("user_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 1], ["created_at", "2020-01-16 23:37:03.355761"], ["updated_at", "2020-01-16 23:37:03.355761"]]

  def update
    logger.info(breed_params)
    @breed = Breed.find(params[:user_id])
    if @breed.update(breed_params)
---
SELECT "breeds".* FROM "breeds" WHERE "breeds"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "breeds" SET "breed_list" = $1, "updated_at" = $2 WHERE "breeds"."id" = $3  [["breed_list", "{11,13,16,19,20}"], ["updated_at", "2020-01-16 23:47:36.143996"], ["id", 1]]

  def destroy
    @breed = Breed.find(params[:user_id])
    @breed.destroy
---
SELECT "breeds".* FROM "breeds" WHERE "breeds"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
DELETE FROM "breeds" WHERE "breeds"."id" = $1  [["id", 8]]

    def set_breed
      @breed = Breed.find(params[:user_id])
---
SELECT "breeds".* FROM "breeds" WHERE "breeds"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]