Pawsibly_api/app/controllers/users_controller.rb

INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["username", "xag"], ["password_digest", "$2a$12$kq.lrfYo4To2v0fCdZa3cOhbQwu8NkwcmcaO7yFXfasQXgQLHtd3K"], ["created_at", "2020-01-16 09:44:21.387833"], ["updated_at", "2020-01-16 09:44:21.387833"]]
---
  def register
    puts params
    @user = User.new(user_params)
    if @user.save

SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "test"], ["LIMIT", 1]]
---
  def login
    # puts params[:password]
    @user = User.find_by(username: params[:username])

UPDATE "users" SET "password_digest" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["password_digest", "$2a$12$BgcrEUgiHXzvvYNCli1SOewqGi5si9r8gTmEN8M6C23t.wiSa3PJW"], ["updated_at", "2020-01-21 03:12:10.491291"], ["id", 4]]
---
  def update
    puts 'youmadeit!'
    if @user.update(user_params)